# RegeneratedElements Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..RegeneratedElements Property
BuiltInFailures..::..RegenFailures Class See Also
---
Elements regenerated in pass [Regen Index]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RegeneratedElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RegeneratedElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RegeneratedElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace